# pandas

## pandas is an open source library providing high performance,easy to use data structures and data analysis tools for the python programming language

* what is Data Frames?
* What is Data series?
* Different operations in pandas

# importing libraries

In [4]:
import pandas as pd
import numpy as np

Dataframe is the combination of rows and col it is represention of data

In [32]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['row1','row2','row3','row4','row5'],columns=['col1','col2','col3','col4'])

In [33]:
df.head()

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [34]:
df.to_csv('test.csv')

# Accessing using loc() and iloc()
## 1)loc
## 2)iloc

In [61]:
print(df[['col1','col2']]) #multipule col

      col1  col2
row1     0     1
row2     4     5
row3     8     9
row4    12    13
row5    16    17

In [63]:
print(df['col1']) #single col

row1     0
row2     4
row3     8
row4    12
row5    16
Name: col1, dtype: int32

In [27]:
print(df.loc['row1'])

col1    0
col2    1
col3    2
col4    3
Name: row1, dtype: int32

In [37]:
print(df.loc['row2'])

col1    4
col2    5
col3    6
col4    7
Name: row2, dtype: int32

In [46]:
print(type(df.loc['row2']))

<class 'pandas.core.series.Series'>

In [42]:
print(df.iloc[:])

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [43]:
print(df.iloc[0:3,0:2])

      col1  col2
row1     0     1
row2     4     5
row3     8     9

In [44]:
print(df.iloc[0:2,0:1])

      col1
row1     0
row2     4

In [45]:
print(type(df.iloc[0:2,0:1]))

<class 'pandas.core.frame.DataFrame'>

In [47]:
print(df.iloc[0:2,0])

row1    0
row2    4
Name: col1, dtype: int32

In [49]:
print(type(df.iloc[0:2,0]))

<class 'pandas.core.series.Series'>

In [50]:
print(df.iloc[:,1:])

      col2  col3  col4
row1     1     2     3
row2     5     6     7
row3     9    10    11
row4    13    14    15
row5    17    18    19

In [54]:
#converting dataframe in to arrays
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [55]:
print(df.shape)

(5, 4)

In [56]:
## checking for null vlaues
print(df.isnull().sum())

col1    0
col2    0
col3    0
col4    0
dtype: int64

In [57]:
print(df['col1'].value_counts())

12    1
4     1
16    1
8     1
0     1
Name: col1, dtype: int64

In [59]:
print(df['col1'].unique())

[ 0  4  8 12 16]

In [5]:
data = pd.read_csv('C:/Users/sai kiran Reddy/Desktop/train.csv')

In [6]:
data.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [73]:
data.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [9]:
#Get catogiery count
data['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
ai     34
m      34
e      32
ba     27
at     25
a      21
ax     19
am     18
aq     18
i      18
u      17
aw     16
l      16
ad     14
k      11
b      11
au     11
r      10
as     10
bc      6
ao      4
c       3
aa      2
q       2
g       1
ac      1
ab      1
Name: X0, dtype: int64

In [10]:
data[data['y']>100]

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
6,24,128.76,al,r,e,f,d,f,h,s,...,0,0,0,0,0,0,0,0,0,0
8,27,108.67,w,s,as,e,d,f,i,h,...,1,0,0,0,0,0,0,0,0,0
9,30,126.99,j,b,aq,c,d,f,a,e,...,0,0,1,0,0,0,0,0,0,0
10,31,102.09,h,r,r,f,d,f,h,p,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4202,8402,123.34,ap,l,s,c,d,aa,d,r,...,0,0,0,0,0,0,0,0,0,0
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

In [13]:
from io import StringIO,BytesIO

In [33]:
data1 = ('a,b,c,d\n'
       '1,2,3,4\n'
       '5,6,7\n'
       '8,9,10')

In [34]:
type(data1)

str

In [35]:
pd.read_csv(StringIO(data1))

   a  b   c    d
0  1  2   3  4.0
1  5  6   7  NaN
2  8  9  10  NaN

In [37]:
s=pd.read_csv(StringIO(data1),dtype=float)

In [38]:
s

     a    b     c    d
0  1.0  2.0   3.0  4.0
1  5.0  6.0   7.0  NaN
2  8.0  9.0  10.0  NaN

In [40]:
s['a']

0    1.0
1    5.0
2    8.0
Name: a, dtype: float64

In [42]:
n=pd.read_csv(StringIO(data1),dtype={'b ':int,'c':np.float,'a':'int64'})

In [43]:
n

   a  b     c    d
0  1  2   3.0  4.0
1  5  6   7.0  NaN
2  8  9  10.0  NaN

In [45]:
n['c']

0     3.0
1     7.0
2    10.0
Name: c, dtype: float64

In [47]:
n['a'][1]

5

In [48]:
data2 = ('index,a,b,c\n'
       '4,apple,bat,5.2\n'
       '8,orange,cow,10')

In [52]:
pd.read_csv(StringIO(data2))

   index       a    b     c
0      4   apple  bat   5.2
1      8  orange  cow  10.0

In [55]:
pd.read_csv(StringIO(data2),index_col=0)

            a    b     c
index
4       apple  bat   5.2
8      orange  cow  10.0

In [56]:
pd.read_csv(StringIO(data2),index_col=1)

        index    b     c
a
apple       4  bat   5.2
orange      8  cow  10.0

In [57]:
pd.read_csv(StringIO(data2),index_col=2)

     index       a     c
b
bat      4   apple   5.2
cow      8  orange  10.0

In [67]:
data3=('a,b,c\n'
       '4,apple,bat,\n'
       '8,orange,cow,')

In [68]:
pd.read_csv(StringIO(data3))

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [70]:
pd.read_csv(StringIO(data3),index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [71]:
pd.read_csv(StringIO(data3),usecols=['b','c'],index_col=False)

        b    c
0   apple  bat
1  orange  cow

In [72]:
data='a,b\n"hello, \\"BOb\\",nice to see you",5'

In [73]:
pd.read_csv(StringIO(data),escapechar='\\')

                              a  b
0  hello, "BOb",nice to see you  5